app/views/participations/_secret_santa.html.erb

   <li><%=x.sender_id%>, <%=x.recipient_id%></li>
  <%user = User.find_by(id: x.sender_id)%>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 2], ["LIMIT", 1]]