gift-swap/app/controllers/events_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
  def show

    @creator = User.find_by(id: @event[:creator_id])