gift-swap/app/controllers/events_controller.rb

  def show
    @participants = @event.participants
    @gift_exchange = GiftExchange.find(params[:id])
    @wishlist = Wishlist.find_by(user_id: @gift_exchange.sender.id)
---
SELECT  "gift_exchanges".* FROM "gift_exchanges" WHERE "gift_exchanges"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  "wishlists".* FROM "wishlists" WHERE "wishlists"."user_id" = $1 LIMIT $2  [["user_id", 4], ["LIMIT", 1]]

  def create
    @event = Event.new(event_params)
    @event.create_pairs
    # binding.pry
    3.times { @event.participants << User.find_by(email: params[:email]) }
---
INSERT INTO "events" ("name", "description", "start_date", "end_date", "suggested_budget", "creator_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
SELECT  "users".* FROM "users" WHERE "users"."email" IS NULL LIMIT $1  [["LIMIT", 1]]