app/views/events/index.html.erb


    <% current_user.events.uniq.each do |event| %>
---
SELECT "events".* FROM "events"