app/controllers/events_controller.rb

  def index

    current_user
    # @event_current_user = Event.all
    # .participants
    # .find(current_user.id)
    # @current_user_events

    @events = Event.all
    @user_events_participations = Participation.find_by(participant_id: current_user.id)
---
SELECT "events".* FROM "events"
SELECT  "participations".* FROM "participations" WHERE "participations"."participant_id" = $1 LIMIT $2  [["participant_id", 2], ["LIMIT", 1]]

  def show
    @participants = @event.participants
    @gift_exchange = GiftExchange.find(params[:id])
    @wishlist = Wishlist.find_by(user_id: @gift_exchange.sender.id)
---
SELECT  "gift_exchanges".* FROM "gift_exchanges" WHERE "gift_exchanges"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  "wishlists".* FROM "wishlists" WHERE "wishlists"."user_id" = $1 LIMIT $2  [["user_id", 4], ["LIMIT", 1]]

  def create
    @event = Event.new(event_params)
    @event.create_pairs
---
INSERT INTO "events" ("name", "description", "suggested_budget", "creator_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["name", "DBC"], ["description", "sdlkgh"], ["suggested_budget", "20"], ["creator_id", 2], ["created_at", "2017-11-16 20:07:00.442113"], ["updated_at", "2017-11-16 20:07:00.442113"]]