app/controllers/events_controller.rb

SELECT COUNT(*) FROM "events"
---
  def index
    current_user
    @events = Event.all
    @user_events_participations = Participation.find_by(participant_id: current_user.id)

    if @events.count and @user_events_participations