app/controllers/gifts_controller.rb

  def index
    @gifts = Gift.all
---
SELECT "gifts".* FROM "gifts"

   def create
    items = Gift.new.add_wanted_gifts(params)
    items.each do |item|
      gift = Gift.create(name: item[:name], price: item[:price].gsub("/","").gsub("$","").to_f,
        url: item[:url], category:item[:category].gsub("/",""))
      wishlist_item = WishlistItem.create(wishlist_id: current_user.wishlists.first.id, gift_id: gift.id)
---
INSERT INTO "gifts" ("name", "price", "url", "category", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
INSERT INTO "wishlist_items" ("wishlist_id", "gift_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["wishlist_id", 2], ["gift_id", 6], ["created_at", "2017-11-15 02:56:57.739464"], ["updated_at", "2017-11-15 02:56:57.739464"]]
SELECT  "wishlists".* FROM "wishlists" WHERE "wishlists"."user_id" = $1 ORDER BY "wishlists"."id" ASC LIMIT $2  [["user_id", 2], ["LIMIT", 1]]

  def destroy
    @gift.destroy
---
DELETE FROM "gifts" WHERE "gifts"."id" = $1  [["id", 12]]

    def set_gift
      @gift = Gift.find(params[:id])
---
SELECT  "gifts".* FROM "gifts" WHERE "gifts"."id" = $1 LIMIT $2  [["id", 12], ["LIMIT", 1]]