app/controllers/participations_controller.rb

  def new
    @event = Event.find_by(id: params[:event_id])
---
SELECT  "events".* FROM "events" WHERE "events"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def create

    @event = Event.find_by(id: params[:event_id])

    if !Participation.find_by(participant_id: @event.creator.id, event_id: @event.id)
      Participation.create(participant_id: @event.creator.id, event_id: @event.id)
    end

    @user = User.find_by(email: params[:user][:email])
---
SELECT  "events".* FROM "events" WHERE "events"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  "participations".* FROM "participations" WHERE "participations"."participant_id" = $1 AND "participations"."event_id" = $2 LIMIT $3  [["participant_id", 2], ["event_id", 7], ["LIMIT", 1]]
INSERT INTO "participations" ("participant_id", "event_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["participant_id", 2], ["event_id", 1], ["created_at", "2017-11-14 23:54:14.263616"], ["updated_at", "2017-11-14 23:54:14.263616"]]
SELECT  "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "catherine@gmail.com"], ["LIMIT", 1]]