app/controllers/wishlists_controller.rb

SELECT  "wishlists".* FROM "wishlists" WHERE "wishlists"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
---
    def set_wishlist
      @wishlist = Wishlist.find(params[:id])