app/views/wishlists/index.html.erb

SELECT  1 AS one FROM "wishlists" WHERE "wishlists"."user_id" = $1 LIMIT $2  [["user_id", 1], ["LIMIT", 1]]
SELECT "wishlists".* FROM "wishlists" WHERE "wishlists"."user_id" = $1  [["user_id", 2]]
---
  <button type="button" class="btn btn-light"><a href='gifts/new'>Add a new item</a></button><br>
<% if current_user.wishlists.empty?%>